{
    "navbar": {
        "skills": "Skills",
        "experiences": "Experiences",
        "projects": "Side Projects",
        "contact": "Contact",
        "language": "Language",
        "languages": {
            "zh-Hant": "Traditional Chinese",
            "en": "English"
        }
    },
    "overview": {
        "quickBio": "Be a clean coder.",
        "introduction": "<p><big>Hello, I'm YY</big>, a game front-end engineer with two years and six months of work experience. </p><p>Main technical skill is developing game front-end, using TypeScript, Pixi.js, Unity, familiar with OOP, a little understanding of design patterns, and participated in the development team running Scurm. Hobbies are making games, playing games, reading books, watching animations. The advantage of myself is that I am very strict with the code, whether it is the relationship between classes or the naming of variables; the disadvantage is that sometimes I spend a lot of time in a few lines for the readability and cleanliness of the code... The dream is to find a group of like-minded people to develop independent games in the future.</p>"
    },
    "skills": {
        "title": "Skills",
        "gameDevSkills": {
            "subSkills": [
                {
                    "name": "Typecript",
                    "description": "A strict superset of JavaScript, I especially like the type-checked part."
                },
                {
                    "name": "Pixi.js",
                    "description": "Lightweight, fast HTML5 rendering engine, the part that doesn't require WebGL knowledge is what appeals to me 😏"
                },
                {
                    "name": "Unity",
                    "description": "Cross-platform game engine, easy-to-use and free. It and C# accompanied my many lonely nights in college."
                }
            ],
            "title": "Game Front-End Development",
            "description": "<p>Game Front-End Development is My interest, and also the part I have the most experience.</p><p>The relevant working experience is two and a half years. TypeScript and Pixi.js are the main skills used in my past career, so those are relatively proficient. Although I have used Unity for a lot of time in college, I have used less experience in my career in the past, and my practical experience is relatively weak. However, if I need to use Unity in my work , I believe I can get started quickly, after all, the visual editor is still very close to the people compared to Terminal.</p>"
        },
        "webDevSkills": {
            "subSkills": [
                {
                    "name": "React.js",
                    "description": "Just write some JavaScript and you can generate a web page. It's so nice."
                },
                {
                    "name": "Webpack",
                    "description": "Although the configuration part is a little complicated, it cannot be denied that it is a good tool for packaging the front end."
                },
                {
                    "name": "HTML",
                    "description": "The skeleton of the web page."
                },
                {
                    "name": "CSS",
                    "description": "The clothes of the web page."
                }
            ],
            "title": "Web Front-End Development",
            "description": "<p>There is no work-related experience using this skill at present, and I am studying hard.</p><p>The reason why front-end web development is also listed as my skill is because I think I have the relevant foundation and interest, although I may need to search Stack Overflow from time to time, and the development of webs must not be smoother than the development of games, but I believe that there are no skills that cannot be learned, mainly depends on the amount of effort.</p><p>The current level of my web front-end is develop a static website like this, keep up learning 👊</p>"
        },
        "generalSkills": {
            "subSkills": [
                {
                    "name": "Enthusiasm",
                    "description": "Since the first Hello World project, I have been very interested in developing games, web pages, and I am very happy to develop on this road in the future!"
                },
                {
                    "name": "Collaboration",
                    "description": "\"Perhaps the most important thing in work is not professional skills, but teamwork.\" This is one of the sentences I realized in my career. Listen to and understand the ideas of your partners more, and everything will be smoother!"
                },
                {
                    "name": "Keep Learning",
                    "description": "Programming Languages and development frameworks are changing with each passing day. Only by keep learning can you strengthen yourself."
                }
            ],
            "title": "General Skill",
            "description": "<p>Work doesn't just require professional skills.</p><p>Keep making mistakes, keep improving, keep learning, keep finding the most suitable way to get along with the team, with colleagues, and with yourself, keep moving forward, and iterate one after another new self.</p><p>Make yourself agile too.</p>"
        }
    },
    "experiences": {
        "title": "Experiences",
        "timeline": {
            "events": [
                {
                    "title": "Unemployed...",
                    "description": "<p>Spend some time every day doing some leetcode and side projects to maintain the feel of coding.</p>"
                },
                {
                    "title": "The Dojo Software Solutions Inc.",
                    "description": "<p>Position: Game front-end engineer.</p><p>My first job, using TypeScript and Pixi.js to develop HTML5 slot games.</p>"
                },
                {
                    "title": "National Formosa University.",
                    "description": "<p>My major is Multimedia Design.</p><p>During school, I specialized in game programming, self-taught C# and Unity, and determined to move forward on the road of game engineer.</p>"
                }
            ]
        },
        "description": "<p>The current total working experience is about two and a half years, and I have worked in one company.</p><p>The previous job was in The Dojo Software Solutions Inc., as a game front-end engineer for two and a half years. The main duties are to develop HTML5 cross-platform slot games, maintain old games and game framework, develop game prototypes, and write game feature documents and API documents. The programming language used in the work is TypeScript, the game framework is developed and maintained by the company itself, and the rendering engine is Pixi.js. During the job, I has developed five games, assisted in the development of three games, and developed the prototypes of two games (the main purpose of the prototype is to show the game designer whether the volatility, payout, and features of the slot game are what he expected look). Among them, I think the most interesting task is to develop the prototype of the game, because only at this process can I get access to the most important data processing. The states of the game and whether the performance is correct depends on whether the feature data formatters of my is written correctly. If the data has incorrect or lacking, I need to report to the back-end engineer I cooperated with. Finally, to make sure that the front-end engineer who takes over doesn't have a headache, so I always have to think carefully about the rationality of data planning and readability. All in all, I have learned a lot and met a lot of good colleagues here. It is a very meaningful time  for me😊</p>"
    },
    "projects": {
        "title": "Side Projects",
        "type": "Type: ",
        "projectType": [
            "Game",
            "Web",
            "Tool"
        ],
        "projectList": [
            {
                "name": "Portfolio(This website)",
                "description": "<p>I think a web page could show more information than a paper CV, so I made this project.</p><p>This project mainly uses react, <nowarptext>react-bootstrap</nowarptext>, <nowarptext>react-i18next</nowarptext>, and webpack. I am using i18next for the first time, I never thought that a multilingual system could be so simple 🥹</p>",
                "links": [
                    {
                        "title": "Repo link"
                    }
                ]
            },
            {
                "name": "Find Different Colors",
                "description": "<p>First time I tried to make a game with a pure web page. I chose a game with relatively simple and clear rules. The gameplay is to find a different color and click on it, that's all!</p><p>This project mainly uses react, <nowarptext>material-ui</nowarptext>, and webpack.</p>",
                "links": [
                    {
                        "title": "Website link"
                    },
                    {
                        "title": "Repo link"
                    }
                ]
            },
            {
                "name": "Random Color Generator",
                "description": "<p>A little tool that randomly generates colors, maybe it will come in handy when you have no inspiration for what colors to use?👀</p><p>This project mainly uses react, <nowarptext>react-native</nowarptext>.</p>",
                "links": [
                    {
                        "title": "Website link"
                    },
                    {
                        "title": "Repo link"
                    }
                ]
            },
            {
                "name": "Reel Tools",
                "description": "<p>This project is quite special. It was done when I was in my first job and no task time. (Anyway, if you are idle, It is better to do something meaningful.)</p><p>This project includes a variety of features. These features are picked by collecting the pain points of engineer development and QA testing. User were engineer and QA, they liked this tool.</p><p>This project mainly uses react, <nowarptext>material-ui</nowarptext>, <nowarptext>react-router-dom</nowarptext>, webpack, by the way, this is my first time using react, I really loved it 😇</p>",
                "links": [
                    {
                        "title": "Website link"
                    },
                    {
                        "title": "Repo link"
                    }
                ]
            },
            {
                "name": "University Game Portfolio",
                "description": "<p>The website of the university's game portfolio. It was made when I graduated from university. If you are interested in the games made by me past, you may as well go and have a look. Those games are mainly developed using Unity.</p><p>This project is developed using HTML, bootstrap and JQuery.</p>",
                "links": [
                    {
                        "title": "Website link"
                    }
                ]
            }
        ],
        "description": "<p>I don't know where I've seen a sentence: \"People who learn programming must do side projects.\" Although I think this sentence is a bit extreme, I have to say that developing side project is indeed a lot of benefits (myself experience), the only thing to worry about is how to allocate your time.</p><p>The following content is the side projects I developed in my spare time (the later in the order, the learlier), some are developed for some special purposes, some are purely developed for fun, and no matter what kind, On the way to development, I can always learn new knowledge and experience new feelings.</p>"
    },
    "contact": {
        "title": "Contact",
        "methods": [
            {
                "name": "Email:",
                "description": "<p>If you want to contact me, please send an email to the above mailbox and indicate your purpose 🙂</p>"
            },
            {
                "name": "LinkedIn:",
                "description": "<p>If you want to know about my current job position, come to LinkedIn!</p>"
            },
            {
                "name": "Github:",
                "description": "<p>If you are interested in my project, come and visit my Github!</p>"
            }
        ]
    }
}